app/controllers/records_controller.rb

SELECT * FROM `records`
---
  def index
    @records = Record.all(:order => 'release_date DESC')

SELECT * FROM `records` WHERE (`records`.`id` = 40)
---
  def show
  	if Record.find_by_slug(params[:id])
	    @record = Record.find_by_slug(params[:id])
	    response.headers['Cache-Control'] = 'public, max-age=3600' # cache for one hour
	  else Record.find(params[:id]) # find (unlike dynamic finders) raises RecordNotFound automatically

SELECT * FROM `songs` ORDER BY title
---
  def new
    @record = Record.new
    15.times do |i|
    	track_number = @record.songs.length + i + 1

INSERT INTO `records` (`label`, `buy_buttons`, `player`, `created_at`, `title`, `updated_at`, `release_date`, `description`, `edition`) VALUES('LidKerCow Ltd.', NULL, NULL, '2010-05-26 04:51:38', 'Blitzen Trapper', '2010-05-26 04:51:38', '2010-11-25', 'The first Blitzen Trapper album had an initial limited release in late 2003, surprising local critics with its confident mix of musical styles and ambitious songwriting, and powering the group into the venerable Willamette Week’s Top 10 New Portland Bands of 2004. Chock-full of hooks and references to guns, the debut veers from stadium rock to Haight-Ashbury to dank lounge to trailer park rave-up to gas station balladry with devious glee. The only Blitzen Trapper work to have been recorded largely in a proper studio, the making of this album so ruined the band financially that the members were reduced to conditions of complete squalor for many years afterwards, out of which straits came the gloriously ramshackle follow-up, Field Rexx.', '')
---
  def create
    @record = Record.new(params[:record])
    if @record.save

SELECT * FROM `records` ORDER BY records.id DESC LIMIT 1
SELECT `songs`.* FROM `songs` INNER JOIN `tracklistings` ON `songs`.id = `tracklistings`.song_id WHERE ((`tracklistings`.record_id = 38))
---
  def edit
    @record = Record.find_by_slug(params[:id])
    15.times do |i|
    	track_number = @record.songs.length + i + 1

UPDATE `records` SET `updated_at` = '2010-05-26 04:53:32', `release_date` = '2003-11-25' WHERE `id` = 1
---
  def update
    @record = Record.find_by_slug(params[:id])
    if @record.update_attributes(params[:record])

DELETE FROM `records` WHERE `id` = 40
---
  def destroy
    @record = Record.find_by_slug(params[:id])
    @record.destroy