app/controllers/shows_controller.rb

  def show
    @show = Show.find(params[:id])
---
SELECT * FROM `shows` WHERE (`shows`.`id` = 1)

  def edit
    @show = Show.find(params[:id])
---
SELECT * FROM `shows` WHERE (`shows`.`id` = 1)

  def update
    @show = Show.find(params[:id])

    # The setlist editor has `setlistings` and `songs` but we need to call
    # them `setlistings_attributes` and `song_attributes` for save to work
    if show_params.has_key? :setlistings
      setlistings_params = show_params.delete(:setlistings)
      encore = show_params.delete(:encore)
      setlistings_params.each do |setlisting_param|
---
SELECT * FROM `shows` WHERE (`shows`.`id` = 1)
DELETE FROM `setlistings` WHERE `id` = 1
SELECT * FROM `setlistings` WHERE (`setlistings`.show_id = 1) ORDER BY track_number