app/controllers/topics_controller.rb

SELECT * FROM `topics` ORDER BY updated_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `topics`
---
  def index
    @topics = Topic.paginate :page => params[:page], :order => 'updated_at DESC'

SELECT * FROM `topics` WHERE (`topics`.`slug` = 'testing') LIMIT 1
---
  def show
    @topic = Topic.find_by_slug(params[:id])

SELECT * FROM `topics` WHERE (`topics`.`slug` = 'lyrics') LIMIT 1
---
  def edit
    @topic = Topic.find_by_slug(params[:id])